InformationRegisters/ТелеграммСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТелеграммСообщения</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ID_Пользователя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Telegram_ВидСообщения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТелеграммКоманды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграммБоты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID_Сообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграммДоступныеКоманды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТелеграммДоступныеКоманды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТелеграммКоманды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID_ПользователяТелеграмм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграммПользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТелеграммПользователи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>first_name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>last_name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ID_Пользователя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграммСлужебныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТелеграммСлужебныеДанные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграммБоты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID_Пользователя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Telegram_ВидСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Telegram_ВидСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТелеграммКоманды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТелеграммКоманды</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтчетЗамеров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТелеграммБоты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТелеграммБоты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ID_чат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТелеграммКоманды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазаЗнанийЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаЗнанийПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорпоративныйАккаунт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Софт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Софт</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Софт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квалификация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омТелеграммСервер/Ext/Module.bsl
Процедура ПолучитьСообщениеБотов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТелеграммБоты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТелеграммБоты КАК ТелеграммБоты
		|ГДЕ
		|	ТелеграммБоты.Активный";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураНастроек = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		ПрочитатьСообщенияПользователя(Выборка.Ссылка, СтруктураНастроек);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьСообщенияПользователя(Бот, СтруктураНастроек = Неопределено) Экспорт
	
	Если СтруктураНастроек = Неопределено Тогда
	
		СтруктураНастроек = ПолучитьНастройкиTelegram(Бот);
	
	КонецЕсли;
	
	МаксимальныйНомерЗаписи = Формат(ПолучитьМаксимальныйНомерЗаписи(Бот) + 1, "ЧГ=0");
	
	Источник = СтрШаблон("bot%1/getUpdates?offset=%2", СтруктураНастроек.token, МаксимальныйНомерЗаписи);
	
	HTTPСоединение  =  Новый HTTPСоединение(СтруктураНастроек.api,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос(Источник);
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json");	
	
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
			Данные = ДесериализоватьJSON(HTTPОтвет.ПолучитьТелоКакСтроку());
			Если Данные.ok И Данные.result.Количество() > 0 Тогда
				 
				Для каждого СтрокаМассива Из Данные.result  Цикл
					
					СообщениеID = СтрокаМассива.update_id;
					
					Если ПроверитьНаличиеСообщенияПоID(СообщениеID, Бот) Тогда
						Продолжить;
					КонецЕсли;
					
					Если СтрокаМассива.Свойство("message") Тогда
						
						message = СтрокаМассива.message;
						
						ПользовательТелеграм = ВернутьСоздатьПользователяTelegram(message.chat);
						
						Команда = ВернутьКомандуTelegram(message, Бот, ПользовательТелеграм);
						ЗаписатьИсториюСообщений(message, СообщениеID, Команда, Бот);					 
						ОбработатьОтветПользователя(Команда, СтруктураНастроек, message, СообщениеID, Бот, ПользовательТелеграм);
						
					ИначеЕсли СтрокаМассива.Свойство("callback_query") Тогда
						
						callback_query = СтрокаМассива.mecallback_queryssage;
						data = СтрокаМассива.data;
						
						ПользовательТелеграм = ВернутьСоздатьПользователяTelegram(callback_query.from.id);
						
						
					КонецЕсли;
					
				КонецЦикла; 
			КонецЕсли; 		
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьИсториюСообщений(message, ID_Сообщения, Команда, Бот)
	
	МенеджерЗаписи = РегистрыСведений.ТелеграммСообщения.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период 			= ТекущаяДата();
	МенеджерЗаписи.Сообщение 		= СокрЛП(message.text);
	МенеджерЗаписи.Команда 			= Команда;
	МенеджерЗаписи.ВидСообщения 	= Перечисления.Telegram_ВидСообщения.Входящее;
	МенеджерЗаписи.ID_Пользователя 	= message.chat.id;
	МенеджерЗаписи.Бот 				= Бот;
	МенеджерЗаписи.ID_Сообщения 	= ID_Сообщения;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ЗаписатьИсториюОтветов(ОтветСистемы, Команда, ID_Сообщения, Бот)
	
	МенеджерЗаписи = РегистрыСведений.Telegram_ИсторияСообщений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период 		= ТекущаяДата();
	МенеджерЗаписи.Сообщение 	= ОтветСистемы;
	МенеджерЗаписи.Бот 			= Бот;
	МенеджерЗаписи.Команда 		= Команда;
	МенеджерЗаписи.ВидСообщения = Перечисления.Telegram_ВидСообщения.Исходящее;
	МенеджерЗаписи.ID_Сообщения = ID_Сообщения;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура ОбработатьОтветПользователя(Команда, СтруктураНастроек, message, СообщениеID, Бот, ПользовательТелеграм)
	      
	Если НЕ ЗначениеЗаполнено(Команда) Тогда
		Возврат;
	КонецЕсли; 	 
	
	
	Если Команда = Перечисления.ТелеграммКоманды.Старт Тогда
		
		ВыполнитьКомандуСтарт(СтруктураНастроек, ПользовательТелеграм, message.chat, Бот);	
		
	Иначе  
	КонецЕсли; 
	

КонецПроцедуры 

Функция ПроверитьНаличиеСообщенияПоID(ID_Сообщения, Бот)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
					|	ТелеграммСообщения.Период КАК Период
					|ИЗ
					|	РегистрСведений.ТелеграммСообщения КАК ТелеграммСообщения
					|ГДЕ
					|	ТелеграммСообщения.ID_Сообщения = &ID_Сообщения
					|	И ТелеграммСообщения.Бот = &Бот";
	
	Запрос.УстановитьПараметр("ID_Сообщения",	ID_Сообщения);
	Запрос.УстановитьПараметр("Бот",			Бот);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаЗапроса.Количество() > 0 Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции // ПроверитьНаличиеСообщенияПоID()

Функция ПолучитьНастройкиTelegram(Бот) Экспорт
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ИмяБота",	"");
	СтруктураНастроек.Вставить("token",		"");
	СтруктураНастроек.Вставить("api",		омТелеграммНаСервереПовторное.ПолучитьAPIТелеграмм());
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТелеграммБоты.Token КАК token,
	               |	ТелеграммБоты.Наименование КАК ИмяБота
	               |ИЗ
	               |	Справочник.ТелеграммБоты КАК ТелеграммБоты
	               |ГДЕ
	               |	ТелеграммБоты.Ссылка = &Бот";
	
	Запрос.УстановитьПараметр("Бот", Бот);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество()>0 Тогда
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктураНастроек, Выборка);
	КонецЕсли;

	Возврат СтруктураНастроек;
	
КонецФункции // ПолучитьПараметры()

Функция ВернутьКомандуTelegram(message, Бот, ПользовательТелеграм)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТелеграммБотыКоманды.Команда КАК Команда
	               |ПОМЕСТИТЬ втКоманда
	               |ИЗ
	               |	Справочник.ТелеграммБоты.Команды КАК ТелеграммБотыКоманды
	               |ГДЕ
	               |	ТелеграммБотыКоманды.Ссылка = &Бот
	               |	И ТелеграммБотыКоманды.НаименованиеКоманды = &НаименованиеКоманды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втКоманда.Команда КАК Команда
	               |ИЗ
	               |	втКоманда КАК втКоманда
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТелеграммДоступныеКоманды КАК ТелеграммДоступныеКоманды
	               |		ПО втКоманда.Команда = ТелеграммДоступныеКоманды.Команда
	               |ГДЕ
	               |	ТелеграммДоступныеКоманды.ID_ПользователяТелеграмм = &ID_ПользователяТелеграмм";
	
	Запрос.УстановитьПараметр("ID_ПользователяТелеграмм",	message.chat.id);
	Запрос.УстановитьПараметр("НаименованиеКоманды",		НРег(message.text));
	Запрос.УстановитьПараметр("Бот", 						Бот);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		Выборка.Следующий();
		Возврат Выборка.Команда;
		
	КонецЕсли; 
	
	Возврат Перечисления.ТелеграммКоманды.ПустаяСсылка();
	
КонецФункции // ВернутьКомандуTelegram()

Функция ВернутьСоздатьПользователяTelegram(chat)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	Telegram_Пользователи.Пользователь КАК Пользователь
					|ИЗ
					|	РегистрСведений.ТелеграммПользователи КАК Telegram_Пользователи
					|ГДЕ
					|	Telegram_Пользователи.ID_Пользователя = &ID_Пользователя";
	
	Запрос.УстановитьПараметр("ID_Пользователя", chat.id);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаЗапроса.Количество()>0 Тогда
		
		ВыборкаЗапроса.Следующий();
		Возврат ВыборкаЗапроса.Пользователь;
		
	КонецЕсли; 
	
	МенеджерЗаписи = РегистрыСведений.ТелеграммПользователи.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.first_name 		= chat.first_name;
	МенеджерЗаписи.last_name 		= chat.last_name;
	МенеджерЗаписи.ID_Пользователя 	= chat.id;
	
	МенеджерЗаписи.Записать(Истина);
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
	
КонецФункции // ВернутьСоздатьПользователяTelegram()

Функция ДесериализоватьJSON(СтрокаJSON) 
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Данные = ПрочитатьJSON(Чтение, Ложь);
	Чтение.Закрыть();	
	
	Возврат Данные;
	
КонецФункции 

Функция ПолучитьМаксимальныйНомерЗаписи(Бот)

	ИмяПараметра = "ID_СообщенияМаксимум";

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТелеграммСлужебныеДанные.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ТелеграммСлужебныеДанные КАК ТелеграммСлужебныеДанные
		|ГДЕ
		|	ТелеграммСлужебныеДанные.ИмяПараметра = &ИмяПараметра
		|	И ТелеграммСлужебныеДанные.Бот = &Бот";
	
	Запрос.УстановитьПараметр("Бот", 			Бот);
	Запрос.УстановитьПараметр("ИмяПараметра", 	ИмяПараметра);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Значение;
	КонецЦикла;
	
    Возврат 0;
	
КонецФункции // ПолучитьМаксимальныйНомерЗаписи()

Функция ОтправитьФайл()
	
	    ТабДок = Новый ТабличныйДокумент;
		
		Отчеты.Telegram_ИсторияСообщений.Создать().СкомпоноватьРезультат(ТабДок);
		
		ИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
		
		ТабДок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLSX);
		
			 
КонецФункции // ОтправитьФайл()

#Область Команды

Процедура ВыполнитьКомандуСтарт(СтруктураНастроек, ПользовательТелеграм, chat, Бот)

	ТекстСтарта = "Выберите действие на клавиатуре.";  
	
	
	
	//МассивКнопок = Новый Массив;
	//МассивКнопок.Добавить("Отчеты");

	//Кнопки = Новый Массив;

	//Для каждого кнопка ИЗ МассивКнопок Цикл
	//	Кнопки.Добавить(Новый Структура("text, callback_data", кнопка, кнопка + "_главное_меню"));
	//КонецЦикла;

	//Строки = Новый Массив;
	//Строки.Добавить(Кнопки);
	//КнопкиJs = ЗаписатьJS(Новый Структура("inline_keyboard", Строки));
	//
	//Приемник = "bot" + СтруктураНастроек.token + "/sendMessage?chat_id=" + Формат(chat.id, "ЧГ=0") + "&text=" + ТекстСтарта + "&reply_markup="+КнопкиJs;
	Приемник = СтрШаблон("bot%1/sendMessage?chat_id=%2&text=%3", СтруктураНастроек.token, Формат(chat.id, "ЧГ=0"), ТекстСтарта);
	
	КлавиатураПользователя = Получить_JOSN_Кнопок(Бот, chat.id);
	
	Если НЕ ПустаяСтрока(КлавиатураПользователя) Тогда
	
		Приемник = Приемник + СтрШаблон("&reply_markup=%1", КлавиатураПользователя);	
	
	КонецЕсли;

	HTTPСоединение  =  Новый HTTPСоединение(СтруктураНастроек.api,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	
	HTTPЗапрос = Новый HTTPЗапрос(Приемник);
	

	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	
	//Ответ.КодСостояния
КонецПроцедуры
	
#КонецОбласти 

Функция Получить_JOSN_Кнопок(Бот, ID_Пользователя)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТелеграммСлужебныеДанные.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ТелеграммСлужебныеДанные КАК ТелеграммСлужебныеДанные
		|ГДЕ
		|	ТелеграммСлужебныеДанные.Бот = &Бот
		|	И ТелеграммСлужебныеДанные.ИмяПараметра = ""ТекстовоеПредставлениеКнопок""
		|	И ТелеграммСлужебныеДанные.ID_Пользователя = &ID_Пользователя";
	
	Запрос.УстановитьПараметр("Бот", 				Бот);
	Запрос.УстановитьПараметр("ID_Пользователя", 	ID_Пользователя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Количество() > 0 Цикл
		Выборка.Следующий();
		Возврат Выборка.Значение;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции // Получить_JOSN_Кнопок()
